{
  "class_name": "Sequential",
  "config": {
    "name": "sequential_5",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [null, null, null],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "bidirectional_12_input"
        }
      },
      {
        "class_name": "Bidirectional",
        "config": {
          "name": "bidirectional_12",
          "trainable": true,
          "dtype": "float32",
          "layer": {
            "class_name": "GRU",
            "config": {
              "name": "gru_12",
              "trainable": true,
              "batch_input_shape": [null, 59, 50],
              "dtype": "float32",
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 75,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": { "gain": 1.0, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2,
              "reset_after": true
            }
          },
          "merge_mode": "concat"
        }
      },
      {
        "class_name": "Bidirectional",
        "config": {
          "name": "bidirectional_13",
          "trainable": true,
          "dtype": "float32",
          "layer": {
            "class_name": "GRU",
            "config": {
              "name": "gru_13",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 75,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": { "gain": 1.0, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2,
              "reset_after": true
            }
          },
          "merge_mode": "concat"
        }
      },
      {
        "class_name": "Bidirectional",
        "config": {
          "name": "bidirectional_14",
          "trainable": true,
          "dtype": "float32",
          "layer": {
            "class_name": "GRU",
            "config": {
              "name": "gru_14",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 75,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": { "gain": 1.0, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2,
              "reset_after": true
            }
          },
          "merge_mode": "concat"
        }
      },
      {
        "class_name": "RepeatVector",
        "config": {
          "name": "repeat_vector_3",
          "trainable": true,
          "dtype": "float32",
          "n": 75
        }
      },
      {
        "class_name": "Bidirectional",
        "config": {
          "name": "bidirectional_15",
          "trainable": true,
          "dtype": "float32",
          "layer": {
            "class_name": "GRU",
            "config": {
              "name": "gru_15",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 75,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": { "gain": 1.0, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2,
              "reset_after": true
            }
          },
          "merge_mode": "concat"
        }
      },
      {
        "class_name": "TimeDistributed",
        "config": {
          "name": "time_distributed_3",
          "trainable": true,
          "dtype": "float32",
          "layer": {
            "class_name": "Dense",
            "config": {
              "name": "dense_3",
              "trainable": true,
              "dtype": "float32",
              "units": 12145,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        }
      }
    ]
  },
  "keras_version": "2.4.0",
  "backend": "tensorflow"
}
